Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/library.tmx
Source language: en
Languages: pl

source: >>> parser.add_argument('integers', metavar='N', type=int, nargs='+', ... help='an integer for the accumulator') >>> parser.add_argument('--sum', dest='accumulate', action='store_const', ... const=sum, default=max, ... help='sum the integers (default: find the max)')
pl: >>> parser.add_argument('integers', metavar='N', type=int, nargs='+', ... help='liczba całkowita dla akumulatora') >>> parser.add_argument('--sum', dest='accumulate', action='store_const', ... const=sum, default=max, ... help='zsumuj liczby całkowite (domyślne: znajdź maksimum)')

source: Later, calling :meth:`parse_args` will return an object with two attributes, ``integers`` and ``accumulate``. The ``integers`` attribute will be a list of one or more ints, and the ``accumulate`` attribute will be either the :func:`sum` function, if ``--sum`` was specified at the command line, or the :func:`max` function if it was not.
pl: Później wywołanie :meth:`parse_args` zwróci przedmiot z dwoma właściwościami, ``całkowitymi liczbami`` i ``akumulacją``. Właściwość ``liczb całkowitych`` będzie listą jednego lub więcej liczb całkowitych, zaś właściwość ``akumulacji`` będzie albo zadaniem sumy - :func:`sum`, jeśli parametr ``--sum`` był określony w wierszu poleceń lub zadaniem :func:`max` jeśli nie był.

source: Parsing arguments
pl: Wczytywanie paramterów

source: :class:`ArgumentParser` parses args through the :meth:`~ArgumentParser.parse_args` method. This will inspect the command-line, convert each arg to the appropriate type and then invoke the appropriate action. In most cases, this means a simple namespace object will be built up from attributes parsed out of the command-line::
pl: Uogólnienie :class:`ArgumentParser` wczytuje parametry przez sposób postępowania :meth:`~ArgumentParser.parse_args`. To przejrzy wiersz poleceń, zamieni każdy parametr do właściwego typu i potem sprowokuje odpowiednie działanie. W większości przypadków, to oznacza że prosty przedmiot przestrzeni nazw będzie zbudowany z właściwości wczytanych z wiersza poleceń::

source: >>> parser.parse_args(['--sum', '7', '-1', '42']) Namespace(accumulate=<built-in function sum>, integers=[7, -1, 42])
pl: >>> parser.parse_args(['--sum', '7', '-1', '42']) Namespace(accumulate=<wbudowane zadanie sumy>, integers=[7, -1, 42])

source: In a script, :meth:`~ArgumentParser.parse_args` will typically be called with no arguments, and the :class:`ArgumentParser` will automatically determine the command-line args from :data:`sys.argv`.
pl: W skrypcie, sposób postępowania :meth:`~ArgumentParser.parse_args` typowo będzie wzywany bez żadnych parametrów, i uogólnienie :class:`ArgumentParser` automatycznie ustali parametry wiersza-polecenia z danych :data:`sys.argv`.

source: ArgumentParser objects
pl: Przedmioty Czytnika ArgumentParser

source: Create a new :class:`ArgumentParser` object. Each parameter has its own more detailed description below, but in short they are:
pl: Stwórz nowy przedmiot :class:`ArgumentParser`. Każdy parametr ma swój własny bardziej szczegółowy opis poniżej, ale po krótce są one:

source: description_ - Text to display before the argument help.
pl: description_ - Tekst do wyświetlenia przed pomocą w sprawie parametru.

source: epilog_ - Text to display after the argument help.
pl: epilog_ - Tekst do wyświetlenia po pomocy w sprawie parametru.

source: add_help_ - Add a -h/--help option to the parser. (default: ``True``)
pl: add_help_ - Dodaje opcję -h/--help do czytnika. (domyślnie ``Prawda`` - z ang. - ``True``)

source: argument_default_ - Set the global default value for arguments. (default: ``None``)
pl: argument_default_ - Ustawia nadrzędną domyślną wartość dla parametru (domyślnie: ``Żadna`` - z ang. - ``None``)

source: parents_ - A list of :class:`ArgumentParser` objects whose arguments should also be included.
pl: parents_ - Lista przedmiotów :class:`ArgumentParser`, których parametry powinny także być załączone.

source: prefix_chars_ - The set of characters that prefix optional arguments. (default: '-')
pl: prefix_chars_ - zestaw znaków które są przedrostkami parametrów opcjonalnych. (domyślnie: '-')

source: fromfile_prefix_chars_ - The set of characters that prefix files from which additional arguments should be read. (default: ``None``)
pl: fromfile_prefix_chars_ - Zestaw znaków które są przedrostkami nazw plików z których dodatkowe parametry powinny zostać wczytane. (domyślne: ``None``)

source: formatter_class_ - A class for customizing the help output.
pl: formatter_class_ - uogólnienie dla uszczegółowienia wypisów pomocy.

source: conflict_handler_ - Usually unnecessary, defines strategy for resolving conflicting optionals.
pl: conflict_handler_ - Zwykle niepotrzebne, określa strategię dla rozwiązywania konfliktujących się opcji.

source: prog_ - The name of the program (default: :data:`sys.argv[0]`)
pl: prog_ - nazwa programu (domyślnie: dane :data:`sys.argv[0]`)

source: usage_ - The string describing the program usage (default: generated)
pl: usage_ - z ang. - użycie_ - ciąg znaków określający użycie programu (domyślnie: generowane)

source: The following sections describe how each of these are used.
pl: Następujące sekcje opisują jak każda z tych jest użyta.

source: description
pl: opis

source: Most calls to the :class:`ArgumentParser` constructor will use the ``description=`` keyword argument. This argument gives a brief description of what the program does and how it works. In help messages, the description is displayed between the command-line usage string and the help messages for the various arguments::
pl: Większość wywołań konstruktora :class:`ArgumentParser` będzie używało słowa kluczowego ``description=``. Ten parametr daje krótki opis tego co program robi i jak działa. W wiadomościach pomocy, opis jest pokazany pomiędzy ciągiem użycia wiersza-poleceń i wiadomości pomocy dla różnych parametrów::

source: >>> parser = argparse.ArgumentParser(description='A foo that bars') >>> parser.print_help() usage: argparse.py [-h] A foo that bars optional arguments: -h, --help show this help message and exit
pl: >>> parser = argparse.ArgumentParser(description='fuu które baruje') >>> parser.print_help() użycie: argparse.py [-h] Fuu, którego baruje opcjonalne parametry: -h, --help pokazuje ten napis pomocy i wychodzi

source: By default, the description will be line-wrapped so that it fits within the given space. To change this behavior, see the formatter_class_ argument.
pl: Domyślnie, opis będzie zawiniętym wierszem, tak, że będzie mieścił się wewnątrz danego miejsca. Aby zmienić to zachowanie, zobacz parametr formatter_class_.

source: Some programs like to display additional description of the program after the description of the arguments. Such text can be specified using the ``epilog=`` argument to :class:`ArgumentParser`::
pl: Niektóre programy lubią wyświetlać dodatkowy opis programu po opisie parametrów. Taki tekst może być specyfikowany przy użyciu parametru ``epilog=`` dla uogólnienia :class:`ArgumentParser`::

source: >>> parser = argparse.ArgumentParser( ... description='A foo that bars', ... epilog="And that's how you'd foo a bar") >>> parser.print_help() usage: argparse.py [-h] A foo that bars optional arguments: -h, --help show this help message and exit And that's how you'd foo a bar
pl: >>> parser = argparse.ArgumentParser( ... description='Foo które baruje', ... epilog="A to jest sposób w jaki foo baruje") >>> parser.print_help() użycie: argparse.py [-h] Foo, które baruje opcjonalne parametry: -h, --help pokazuje tą wiadomość pomocy i wychodzi. A to jest sposób w jaki foo baruje

source: As with the description_ argument, the ``epilog=`` text is by default line-wrapped, but this behavior can be adjusted with the formatter_class_ argument to :class:`ArgumentParser`.
pl: Tak jak z parametrem opisu description_, ``epilog=`` tekst jest domyślnie zawijanym wierszem, ale to zachowanie może być dostosowane za pomocą parametru formatter_class_ dla uogólnienia :class:`ArgumentParser`.

source: By default, ArgumentParser objects add a ``-h/--help`` option which simply displays the parser's help message. For example, consider a file named ``myprogram.py`` containing the following code::
pl: Domyślnie, przedmioty ArgumentParser dodają opcję ``-h/--help`` która po prostu wyświetla wiadomość pomocy czytnika. Na przykład, rozważ plik nazwany ``myprogram.py`` zawierający następujący kod::

source: import argparse parser = argparse.ArgumentParser() parser.add_argument('--foo', help='foo help') args = parser.parse_args()
pl: import argparse parser = argparse.ArgumentParser() parser.add_argument('--foo', help='pomoc foo') args = parser.parse_args()

source: If ``-h`` or ``--help`` is supplied is at the command-line, the ArgumentParser help will be printed::
pl: Jeśli ``-h`` lub ``--help`` jest dostarczony w wierszu poleceń, pomoc ArgumentParser'a będzie wypisana::

source: $ python myprogram.py --help usage: myprogram.py [-h] [--foo FOO] optional arguments: -h, --help show this help message and exit --foo FOO foo help
pl: $ python myprogram.py --help użycie: myprogram.py [-h] [--foo FOO] opcjonalne parametry: -h, --help pokazuje tą wiadomość pomocy i wychodzi --foo FOO pomoc foo

source: Occasionally, it may be useful to disable the addition of this help option. This can be achieved by passing ``False`` as the ``add_help=`` argument to :class:`ArgumentParser`::
pl: Okazjonalnie, może być użyteczne wyłączenie dodatku tej opcji pomocy. To można osiągnąć przez przekazanie ``False`` dla ``add_help=`` parametru :class:`ArgumentParser`::

source: >>> parser = argparse.ArgumentParser(prog='PROG', add_help=False) >>> parser.add_argument('--foo', help='foo help') >>> parser.print_help() usage: PROG [--foo FOO] optional arguments: --foo FOO foo help
pl: >>> parser = argparse.ArgumentParser(prog='PROG', add_help=False) >>> parser.add_argument('--foo', help='foo help') >>> parser.print_help() użycie: PROG [--foo FOO] opcjonalne parametry: --foo FOO foo help

source: prefix_chars
pl: znaki_przedrostka - z ang. - prefix_chars

source: Most command-line options will use ``'-'`` as the prefix, e.g. ``-f/--foo``. Parsers that need to support additional prefix characters, e.g. for options like ``+f`` or ``/foo``, may specify them using the ``prefix_chars=`` argument to the ArgumentParser constructor::
pl: większość opcji wiersza polecenia będzie używało ``'-'`` jako przedrostka, np. ``-f/--foo``. Czytniki, które wymagają wsparcia dodatkowych znaków przedrostka, np. dla opcji takich, jak ``+f`` lub ``/foo``, mogą określać je używając parametru ``prefix_chars=`` dla konstruktora ArgumentParser::

source: The ``prefix_chars=`` argument defaults to ``'-'``. Supplying a set of characters that does not include ``'-'`` will cause ``-f/--foo`` options to be disallowed.
pl: Parametr ``prefix_chars=`` domyślnie jest równy ``'-'``. Dostarczając zbiór znaków który nie zawiera ``'-'`` spowoduje że opcje ``-f/--foo`` będą niedozwolone.

source: fromfile_prefix_chars
pl: fromfile_prefix_chars - z ang. - zpliku_znaki_przedrostka

source: Sometimes, for example when dealing with a particularly long argument lists, it may make sense to keep the list of arguments in a file rather than typing it out at the command line. If the ``fromfile_prefix_chars=`` argument is given to the :class:`ArgumentParser` constructor, then arguments that start with any of the specified characters will be treated as files, and will be replaced by the arguments they contain. For example::
pl: czasami, dla przykładu gdy w grę wchodzą szczególnie długie listy parametrów, może mieć sens przechowywanie listy parametrów w pliku zamiast wpisywać je w wierszu poleceń. Jeśli parametr ``formfile_prefix_chars=`` jest dany dla konstruktora uogólnienia :class:`ArgumentParser`, wtedy parametry które zaczynają się na którekolwiek z podanych znaków będą traktowane jak pliki i będą zamienione przez zawartość którą posiadają. Na przykład::

source: Arguments read from a file must by default be one per line (but see also :meth:`convert_arg_line_to_args`) and are treated as if they were in the same place as the original file referencing argument on the command line. So in the example above, the expression ``['-f', 'foo', '@args.txt']`` is considered equivalent to the expression ``['-f', 'foo', '-f', 'bar']``.
pl: Parametry wczytywane z pliku muszą domyślnie być jeden na linię (ale zobacz też sposób postępowania :meth:`convert_arg_line_to_args`) i są traktowane tak jakby były w tym samym miejscu, jak oryginalny plik odnoszący się do parametru w wierszu polecenia. Więc na przykład w powyższym wyrażenie ``['-f', 'foo', '@args.txt']`` jest uważane za równoważne wyrażeniu ``['-f', 'foo', '-f', 'bar']``.

source: The ``fromfile_prefix_chars=`` argument defaults to ``None``, meaning that arguments will never be treated as file references.
pl: Parametr ``fromfile_prefix_chars=`` domyślnie równy jest ``None``, w znaczeniu, że parametry nigdy nie będą traktowane jako odniesienia do plików.

source: argument_default
pl: parametr_domyślny - z ang. - argument_default

source: Generally, argument defaults are specified either by passing a default to :meth:`add_argument` or by calling the :meth:`set_defaults` methods with a specific set of name-value pairs. Sometimes however, it may be useful to specify a single parser-wide default for arguments. This can be accomplished by passing the ``argument_default=`` keyword argument to :class:`ArgumentParser`. For example, to globally suppress attribute creation on :meth:`parse_args` calls, we supply ``argument_default=SUPPRESS``::
pl: Ogólnie, domyślne parametry są określane albo przez przekazanie domyślnej wartości do sposobu postępowania :meth:`add_argument` albo przez wezwanie sposobu postępowania :meth:`set_defaults` ze szczególnym zbiorem par nazwa-wartość. Czasami jednakże, może być użyteczne określenie pojedynczej szerokości-czytnika domyślnej wartości dla parametrów. To może być osiągnięte przez przekazanie parametru słowa kluczowego ``argument_default=`` dla uogólnienia :class:`ArgumentParser`. Dla przykładu, aby nadrzędnie wycofać tworzenie właściwości w przypadku wywołania :meth:`parse_args`, dostarczamy ``argument_default=SUPPRESS``::

source: parents
pl: rodzice - z ang. - parents

source: Sometimes, several parsers share a common set of arguments. Rather than repeating the definitions of these arguments, a single parser with all the shared arguments and passed to ``parents=`` argument to :class:`ArgumentParser` can be used. The ``parents=`` argument takes a list of :class:`ArgumentParser` objects, collects all the positional and optional actions from them, and adds these actions to the :class:`ArgumentParser` object being constructed::
pl: Czasami, kilka czytników współdzieli wspólny zestaw parametrów. Zamiast powtarzać definicje tych parametrów, pojedynczy czytnik ze wszystkimi współdzielonymi parametrami i przekazany do parametru ``parents=`` dla uogólnienia :class:`ArgumentParser` może być użyty. Parametr ``parents=`` przyjmuje listę przedmiotów :class:`ArgumentParser`, zbiera wszystkie pozycyjne i opcjonalne działania od nich, i dodaje te działania do przedmiotu :class:`ArgumentParser` będącego konstruowanym::

source: Note that most parent parsers will specify ``add_help=False``. Otherwise, the :class:`ArgumentParser` will see two ``-h/--help`` options (one in the parent and one in the child) and raise an error.
pl: Zauważ że większość czytników rodziców będzie określała ``add_help=False``. W przeciwnym razie przedmiot :class:`ArgumentParser` zobaczy dwie ``-h/--help`` opcje (jedną dla rodzica jedną dla potomka) i zgłosi błąd.

source: formatter_class
pl: formatter_class - uogolnienie_formatujace

source: :class:`ArgumentParser` objects allow the help formatting to be customized by specifying an alternate formatting class. Currently, there are three such classes: :class:`argparse.RawDescriptionHelpFormatter`, :class:`argparse.RawTextHelpFormatter` and :class:`argparse.ArgumentDefaultsHelpFormatter`. The first two allow more control over how textual descriptions are displayed, while the last automatically adds information about argument default values.
pl: Przedmioty :class:`ArgumentParser` pozwalają formatowaniu pomocy aby była uszczegółowiona przez określenie alternatywnego uogólnienia formatującego. Obecnie istnieją trzy takie uogólnienia: :class:`argparse.RawDescriptionHelpFormatter` :class:`argparse.RawTextHelpFormatter` i :class:`argparse.ArgumentDefaultsHelpFormatter`. Pierwsze dwa pozwalają na więcej kontroli ponad tym jak opisy tekstowe są pokazywane, podczas gdy ostatni automatycznie dodaje informacje o wartościach domyślnych parametru.

source: By default, :class:`ArgumentParser` objects line-wrap the description_ and epilog_ texts in command-line help messages::
pl: Domyślnie, przedmioty :class:`ArgumentParser` zawijają wiersze opisu - z ang. - description_ i epilogu - epilog_ w wiadomościach pomocy wiersza polecenia::

source: >>> parser = argparse.ArgumentParser( ... prog='PROG', ... description='''this description ... was indented weird ... but that is okay''', ... epilog=''' ... likewise for this epilog whose whitespace will ... be cleaned up and whose words will be wrapped ... across a couple lines''') >>> parser.print_help() usage: PROG [-h] this description was indented weird but that is okay optional arguments: -h, --help show this help message and exit likewise for this epilog whose whitespace will be cleaned up and whose words will be wrapped across a couple lines
pl: >>> parser = argparse.ArgumentParser( ... prog='PROG', ... description='''ten opis ... był wcięty dziwnie ... ale to nie szkodzi''', ... epilog=''' ... podobnie dla epilogu, którego białe znaki będą ... uporządkowane i którego słowa zostaną zawinięte ... na przestrzeni kilku wierszy''') >>> parser.print_help() użycie: PROG [-h] ten opis był wcięty dziwnie ale to nie szkodzi opcjonalne parametry: -h, --help pokaż tą wiadomość pomocy i wyjdź podobnie dla epilogu, którego białe znak będą uporządkowane i którego słowa zostaną zawinięte na przestrzeni kilku wierszy

source: Passing :class:`argparse.RawDescriptionHelpFormatter` as ``formatter_class=`` indicates that description_ and epilog_ are already correctly formatted and should not be line-wrapped::
pl: Przekazanie :class:`argparse.RawDescriptionHelpFormatter jako ``formatter_class=`` wskazuje, że opis - z ang. - description_ i epilog - epilog_ są już prawidłowo sformatowane i nie powinny być zawijane wierszami::

source: >>> parser = argparse.ArgumentParser( ... prog='PROG', ... formatter_class=argparse.RawDescriptionHelpFormatter, ... description=textwrap.dedent('''\ ... Please do not mess up this text! ... -------------------------------- ... I have indented it ... exactly the way ... I want it ... ''')) >>> parser.print_help() usage: PROG [-h] Please do not mess up this text! -------------------------------- I have indented it exactly the way I want it optional arguments: -h, --help show this help message and exit
pl: >>> parser = argparse.ArgumentParser( ... prog='PROG', ... formatter_class=argparse.RawDescriptionHelpFormatter, ... description=textwrap.dedent('''\ ... Proszę nie pomieszaj tego tekstu! ... ------------------------------------- ... Wciąłem go ... dokładnie w sposób ... w jaki tego pragnąłem ... ''')) >>> parser.print_help() użycie: PROG [-h] Proszę nie pomieszaj tego tekstu! ----------------------------------------- Wciąłem go dokładnie w sposób w jaki tego pragnąłem opcjonalne parametry: -h, --help pokaż tą wiadomość pomocy i wyjdź

source: :class:`RawTextHelpFormatter` maintains whitespace for all sorts of help text including argument descriptions.
pl: :class:`RawTextHelpFormatter` utrzymuje białe znaki dla wszystkich rodzajów tekstu pomocy zawierającego opisy parametrów.

source: The other formatter class available, :class:`ArgumentDefaultsHelpFormatter`, will add information about the default value of each of the arguments::
pl: Pozostałe dostępne uogólnienie przedmiotu formatującego :class:`ArgumentDefaultsHelpFormatter`, będzie dodawało informacje o domyślnej wartości każdego z parametrów::

source: >>> parser = argparse.ArgumentParser( ... prog='PROG', ... formatter_class=argparse.ArgumentDefaultsHelpFormatter) >>> parser.add_argument('--foo', type=int, default=42, help='FOO!') >>> parser.add_argument('bar', nargs='*', default=[1, 2, 3], help='BAR!') >>> parser.print_help() usage: PROG [-h] [--foo FOO] [bar [bar ...]] positional arguments: bar BAR! (default: [1, 2, 3]) optional arguments: -h, --help show this help message and exit --foo FOO FOO! (default: 42)
pl: >>> parser = argparse.ArgumentParser( ... prog='PROG', ... formatter_class=argparse.ArgumentDefaultsHelpFormatter) >>> parser.add_argument('--foo', type=int, default=42, help='FOO!') >>> parser.add_argument('bar', nargs='*', default=[1, 2, 3], help='BAR!') >>> parser.print_help() usage: PROG [-h] [--foo FOO] [bar [bar ...]] pozycyjne parametry: bar BAR! (default: [1, 2, 3]) opcjonalne parametry: -h, --help pokaż tą wiadomość pomocy i wyjdź --foo FOO FOO! (default: 42)

source: conflict_handler
pl: rozstrzyganie_konfilktow - z ang. - conflict_handler

source: :class:`ArgumentParser` objects do not allow two actions with the same option string. By default, :class:`ArgumentParser` objects raises an exception if an attempt is made to create an argument with an option string that is already in use::
pl: przedmioty :class:`ArgumentParser` nie pozwalają na dwa działania o tym samym ciągu znaków opcji. Domyślnie, przedmioty :class:`ArgumentParser` zgłaszają wyjątek, jeśli próba jest podejmowana aby utworzyć parametr z ciągiem znaków opcji który już jest używany::

source: >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('-f', '--foo', help='old foo help') >>> parser.add_argument('--foo', help='new foo help') Traceback (most recent call last): .. ArgumentError: argument --foo: conflicting option string(s): --foo
pl: >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('-f', '--foo', help='stara pomoc foo') >>> parser.add_argument('--foo', help='nowa pomoc foo') Wypis (najmłodsze wywołanie ostatnie): .. ArgumentError: parametr --foo: skonfliktowane ciągi znaków opcji: --foo

source: Sometimes (e.g. when using parents_) it may be useful to simply override any older arguments with the same option string. To get this behavior, the value ``'resolve'`` can be supplied to the ``conflict_handler=`` argument of :class:`ArgumentParser`::
pl: Czasami (np. gdy używa się rodziców - z ang. - parents_) to może być użyteczne aby po prostu przesłonić wszelkie starsze parametry tym samym ciągiem znaków opcji. Aby uzyskać takie zachowanie, wartość ``'resolve'`` może być dostarczona do parametru ``rozstrzyganie_konfliktu`` ``conflict_handler`` uogólnienia :class:`ArgumentParser`::

source: >>> parser = argparse.ArgumentParser(prog='PROG', conflict_handler='resolve') >>> parser.add_argument('-f', '--foo', help='old foo help') >>> parser.add_argument('--foo', help='new foo help') >>> parser.print_help() usage: PROG [-h] [-f FOO] [--foo FOO] optional arguments: -h, --help show this help message and exit -f FOO old foo help --foo FOO new foo help
pl: >>> parser = argparse.ArgumentParser(prog='PROG', conflict_handler='resolve') >>> parser.add_argument('-f', '--foo', help='stara pomoc foo') >>> parser.add_argument('--foo', help='nowa pomoc foo') >>> parser.print_help() użycie: PROG [-h] [-f FOO] [--foo FOO] opcjonalne parametry: -h, --help pokaż ten komunikat pomocy i wyjdź -f FOO stara pomoc foo --foo FOO nowa pomoc foo
